/*******************************************************************************
*  InfrredRecive.pde - 赤外線受信関数の使い方サンプル２                        *
*   ２番に接続された赤外線受信モジュールからデータを受信します。               *
*   受信データはArduinoIDEに送信する。                                         *
*                                                                              *
* ============================================================================ *
*  VERSION DATE        BY                    CHANGE/COMMENT                    *
* ---------------------------------------------------------------------------- *
*  1.00    2011-07-09  きむ茶工房(きむしげ)  Create                            *
*******************************************************************************/
#include <skInfraredCOM.h>

skInfraredCOM Infrared(-1,2) ; // 赤外線関連ライブラリを生成する(2番ピンから入力)


/*******************************************************************************
*  電源起動時とリセットの時だけのみ処理される関数(初期化と設定処理)            *
*******************************************************************************/
void setup()
{
     Serial.begin(9600) ;	// ArduinoIDEと通信する為の初期化処理
}
/*******************************************************************************
*  繰り返し実行される処理の関数(メインの処理)                                  *
*******************************************************************************/
void loop()
{
     unsigned char MyDeviceNo ;   // 自局の識別デバイス番号
     unsigned char KeyNo ;        // 受信した通知情報データ

     MyDeviceNo = 0x0a ;
     KeyNo = Infrared.Recive(MyDeviceNo) ; // 受信する
     if (KeyNo != 0) {
          Serial.println(KeyNo,DEC) ;     // データを受信したのでＩＤＥに送信する
     }
}
