/*******************************************************************************
*  InfrredSend.pde - 赤外線送信関数の使い方サンプル                            *
*   ３番に接続された赤外線送信ＬＥＤからデータを送信します。                   *
*   １秒毎にデータ0x30～0x7bを繰り返し送信します。                             *
*                                                                              *
* ============================================================================ *
*  VERSION DATE        BY                    CHANGE/COMMENT                    *
* ---------------------------------------------------------------------------- *
*  1.00    2011-07-09  きむ茶工房(きむしげ)  Create                            *
*******************************************************************************/
#include <skInfraredCOM.h>


skInfraredCOM Infrared(3,-1) ; // 赤外線関連ライブラリを生成する(3番ピンから出力)

/*******************************************************************************
*  電源起動時とリセットの時だけのみ処理される関数(初期化と設定処理)            *
*******************************************************************************/
void setup()
{
     delay(5000) ;                 // ５秒後に送信開始
}
/*******************************************************************************
*  繰り返し実行される処理の関数(メインの処理)                                  *
*******************************************************************************/
void loop()
{
     int i ;
     unsigned char KeyNo ;

    for (i=0x30 ; i<0x7b ; i++) {
          KeyNo = (unsigned char)i ;
          Infrared.Send(255,KeyNo) ;	// 送信相手番号=255(一斉通知)
          delay(1000) ;			// １秒毎に処理する
    }
}
